## Introduction
<p><img src="https://assets.datacamp.com/production/project_981/img/lego_unsplash.jpg" alt="A picture of Lego characters!"></p>
<h3>Let's look at Lego sets!</h3>
<p>Lego is a household name across the world, supported by a diverse toy line, hit movies, and a series of successful video games. In this project, we are going to explore a key development in the history of Lego: the introduction of licensed sets such as Star Wars, Super Heroes, and Harry Potter.</p>
<p>It may not be widely known, but Lego has had its share of ups and downs since its inception in the early 20th century. This includes a particularly rough period in the late 90s. As described in <a href="https://www.businessinsider.com/how-lego-made-a-huge-turnaround-2014-2?r=US&IR=T">this article</a>, Lego was only able to survive due to a successful internal brand (Bionicle) and the introduction of its first licensed series: Star Wars. In the instructions panel are the two questions you will need to answer to complete this project.</p>
<p>Before diving into our analysis though, let's become familiar with the two datasets that will help you with this project:<br><br></p>
<div>
    <div style="font-size:20px"><b>datasets/lego_sets.csv</b></div>
<ul>
    <li><b>set_num:</b> A code that is unique to each set in the dataset. <b><i>This column is critical, and a missing value indicates the set is a duplicate or invalid!</i></b></li>
    <li><b>set_name:</b> A name for every set in the dataset (note that this can be the same for different sets).</li>
    <li><b>year:</b> The date the set was released.</li>
    <li><b>num_parts:</b> The number of parts contained in the set.<b><i> This column is not central to our analyses, so missing values are acceptable.</i></b></li>
        <li><b>theme_name:</b> The name of the sub-theme of the set.</li>
    <li><b>parent_theme:</b> The name of the parent theme the set belongs to. Matches the `name` column of the `parent_themes` csv file.</li>
</ul>

<div style="font-size:20px"><b>datasets/parent_themes.csv</b></div>
<ul>
    <li><b>id:</b> A code that is unique to every theme.</li>
    <li><b>name:</b> The name of the parent theme.</li>
    <li><b>is_licensed:</b> A Boolean column specifying whether the theme is a licensed theme.</li>
</ul>
    </div>

In [37]:
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

sets = pd.read_csv('./datasets/lego_sets.csv')
theme = pd.read_csv('./datasets/parent_themes.csv')

Cleaning data by removing all rows that have 'set_num' as null as they are invalid.

In [52]:
sets.dropna(subset=['set_num'],inplace=True)

In [53]:
sets.isna().sum()

set_num            0
name               0
year               0
num_parts       4998
theme_name         0
parent_theme       0
dtype: int64

We can leave the num_parts columns with null values because its not important to our analysis

##### Q. What percentage of all licensed themes were star wars themed?

In [5]:
sets.head()

,set_num,name,year,num_parts,theme_name,parent_theme
0,00-1,Weetabix Castle,1970,471.0,Castle,Legoland
1,0011-2,Town Mini-Figures,1978,NaN,Supplemental,Town
2,0011-3,Castle 2 for 1 Bonus Offer,1987,NaN,Lion Knights,Castle
3,0012-1,Space Mini-Figures,1979,12.0,Supplemental,Space
4,0013-1,Space Mini-Figures,1979,12.0,Supplemental,Space

In [4]:
theme.head()

    id     name  is_licensed
0    1  Technic        False
1   22  Creator        False
2   50     Town        False
3  112   Racers        False
4  126    Space        False

In [54]:
merged_df = sets.merge(theme,left_on='parent_theme',right_on='name')

In [55]:
subset = merged_df[merged_df['is_licensed'] == True]
num_lic = len(subset)
num_sw = (subset['parent_theme'] == 'Star Wars').sum()
percentage = num_sw/num_lic *100 
print(percentage)

51.653944020356235

In [106]:
g1 = subset.groupby(['year','parent_theme'],as_index=False)['name_x'].count()

In [107]:
g1

    year              parent_theme  name_x
0   1999                 Star Wars      13
1   2000     Disney's Mickey Mouse       5
2   2000                 Star Wars      26
3   2001              Harry Potter      11
4   2001                 Star Wars      14
..   ...                       ...     ...
78  2017           Disney Princess       6
79  2017                 Minecraft       9
80  2017  Pirates of the Caribbean       1
81  2017                 Star Wars      55
82  2017              Super Heroes      72

[83 rows x 3 columns]

In [108]:
g2 = g1.groupby(['year']).apply(lambda x: x['parent_theme'][x['name_x'].idxmax()])

In [109]:
g2

year
1999       Star Wars
2000       Star Wars
2001       Star Wars
2002       Star Wars
2003       Star Wars
2004       Star Wars
2005       Star Wars
2006       Star Wars
2007       Star Wars
2008       Star Wars
2009       Star Wars
2010       Star Wars
2011       Star Wars
2012       Star Wars
2013       Star Wars
2014       Star Wars
2015       Star Wars
2016       Star Wars
2017    Super Heroes
dtype: object